Tekla.Structures.Drawing.TextElement
The TextElement class defines a user-defined text in a mark content.

Tekla.Structures.Drawing.TextElement.Font
The font of the text element.

Tekla.Structures.Drawing.TextElement.Value
The textual value of the text element.

Tekla.Structures.Drawing.TextElement.#ctor(System.String)
Creates a new text element instance with the given textual value.
Text: The textual value to be used.

Tekla.Structures.Drawing.TextElement.#ctor(System.String,Tekla.Structures.Drawing.FontAttributes)
Creates a new text element instance with the given textual value and font.
Text: The textual value to be used.
Font: The font to be used.

Tekla.Structures.Drawing.TextElement.Clone
Clones the object.
Returns: A copy of the object.

Tekla.Structures.Drawing.TextElement.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.TextElement.GetUnformattedString
Returns the content as a string without formatting.
Returns: The content as a string without formatting.